{
    "first_name": "Alex",
    "last_name": "Lin",
    "professional": "Deep learning | Full Stack | Data Scraping",
    "overview": "Self-motivated and experienced senior AI Engineer with 7+ years of experience in Chatbot and NLP. Especially have powerful AI experience. A clear understanding of requirements + professional/technical suggestions + best quality + satisfaction with my clients are kinds of my service. I'm trying to keep good relationships with clients based on trustworthiness.\n\nA front-end developer with a successful track record of bringing conceptual ideas to fully functional applications. Worked with a handful of clients in a variety of industries. Deliver clean codes and propose creative ideas to complete projects or solve issues in Agile Methodology and deadlines.\n\nFamiliar with GitHub, GitLab, and Bitbucket to manage versions and collaborate. Very interested in getting new web technology and trend \nHave rich experience in Nodejs, Laravel, Flutter, Django, Flask, React, Angular, Vue, etc. Proficient in other programming languages such as Python, Java, C++, Ruby, PHP, and databases such as SQL, MongoDB, etc. Have sufficient experience in building and maintaining CI/CD pipelines. Especially have rich experience in developing E-Commerce sites. Have rich experience in developing chatbot using OpenAI and Langchain. Passionate about Artificial Intelligence",
    "country": "Canada",
    "hourRate": "30",
    "languages": [
		[
            "English",
            "4"
        ]
	],
    "skills": ["Python", "Full-Stack Development", "JavaScript", "web3.j", "Web Scraping", "Next.js", "React Native", "React", "WordPress", "ChatGPT", "Artificial Intelligence", "Chatbot Development", "OpenAI Codex", "Machine Learning", "Natural Language Processing"],
    "services": ["AI & Machine Learning", "Desktop Application Development", "DevOps & Solution Architecture", "Web Development", "Web & Mobile Design", "Network & System Administration", "Blockchain, NFT & Cryptocurrency", "Ecommerce Development", "Data Analysis & Testing"],
    "street": "Elm Street",
    "zipcode": "J2G 3F5",
    "city": "Saskatoon",
    "location": "Canada",
    "phone": "+1 423-211-9834",
    "avatar": "Me.jpg"
}